1c_um/src/InformationRegisters/ум_ПакетыДанных/ум_ПакетыДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ум_ПакетыДанных</name>
  <resources>
    <name>ВременнаяМеткаСоздания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КлючАналитикиПакетаДанных</name>
    <type>
      <types>CatalogRef.ум_КлючиАналитикиПакетовДанных</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСозданияПакета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбработкиПакета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСледующейОбработкиПакета</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДлительностьОбработки</name>
    <comment>Длительность обработки</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючРабочегоПотока</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПакетПрипаркован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>ИдентификаторПакета</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

1c_um/src/Enums/ум_СостоянияПакетаДанных/ум_СостоянияПакетаДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ум_СостоянияПакетаДанных</name>
  <enumValues>
    <name>ВОбработке</name>
  </enumValues>
  <enumValues>
    <name>КОбработке</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
</mdclass:Enum>

1c_um/src/Catalogs/ум_СпособыОбработкиПакетов/ум_СпособыОбработкиПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ум_СпособыОбработкиПакетов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>МногопоточноеИзменениеПакетовДанных</name>
      <description>Многопоточное изменение пакетов данных</description>
    </items>
    <items>
      <name>ОчисткаЛоговФЗ</name>
      <description>Очистка логов ФЗ</description>
    </items>
    <items>
      <name>ПакетыДанныхОбслуживание</name>
      <description>Регламентное обслуживание пакетов данных</description>
    </items>
  </predefined>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФункции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДляРазработчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЖизниУправляющегоФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПакетовНаУправляющееФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЖизниРабочегоФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПакетовНаРабочееФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокОбработкиПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПовторнаяОбработкаПакетовСОшибками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутПовторнойОбработкиПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьПакетПриУспешнойОбработке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутУдаленияПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОбщийСписокОшибок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроизвольныйКодОбработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйКодОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешСуммаПроизвольногоКодаОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючРегламентногоЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОшибкиОбработкиПакетов</name>
    <attributes>
      <name>ОписаниеОшбики</name>
      <type>
        <types>CatalogRef.ум_ОписанияОшибокОбработкиПакетов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

1c_um/src/CommonModules/ум_ИзменениеПакетовДанных/Module.bsl
#Область ПрограммныйИнтерфейс

// Выполняет список действит над пакетами
// 
// Параметры:
//  ОписаниеДействий    - Структура - описание действий над пакетами
//  МассивИДПакетов     - Массив - массив идентификаторы пакетов
//
// Возвращаемое значение:
//   Структура - где:
//      Ошибка - Булево - Истина если есть ошибка иначе Ложь
//      ОписаниеОшибки  - Строка - Описание ошибки если Ошибка = Истина иначе Неопределено
Функция ИзмененитьПакетыДанных(ОписаниеДействий, МассивИДПакетов) Экспорт
	
	// МассивИДПакетов = СписокИдентификаторовПакетов.ВыгрузитьЗначения();
	
	Если ОписаниеДействий.Свойство("УдалитьПакеты") и ОписаниеДействий.УдалитьПакеты Тогда
		Результат = ум_ПакетыДанныхОбслуживание.УдалитьПакетыДанныхИСвязанныеДанные(МассивИДПакетов);
		Возврат Результат;
	КонецЕсли;
	
	// Подготовим таблицу для блокировки Пакетов 
	ТаблицаИДПакетов = Новый ТаблицаЗначений;
	ТаблицаИДПакетов.Колонки.Добавить("ИдентификаторПакета", Новый ОписаниеТипов("УникальныйИдентификатор"));
	Для каждого ЭлементМассива из МассивИДПакетов Цикл
		СтрТаб = ТаблицаИДПакетов.Добавить();
		СтрТаб.ИдентификаторПакета = ЭлементМассива;
	КонецЦикла;
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);  
	
	// заблокируем пакеты данных
	БлокировкаПакеты = Новый БлокировкаДанных;
	ЭлементБлокировкиПакеты = БлокировкаПакеты.Добавить("РегистрСведений.ум_ПакетыДанных");
	ЭлементБлокировкиПакеты.Режим = РежимБлокировкиДанных.Исключительный; 
	ЭлементБлокировкиПакеты.ИсточникДанных = ТаблицаИДПакетов;
	ЭлементБлокировкиПакеты.ИспользоватьИзИсточникаДанных("ИдентификаторПакета", "ИдентификаторПакета");
	
	Попытка
		БлокировкаПакеты.Заблокировать();
	Исключение
		ОтменитьТранзакцию();
		Возврат Новый Структура("Ошибка, ОписаниеОшибки", Истина, ОписаниеОшибки()); 
	КонецПопытки;
	
	// Прочитаем заблокированные пакеты
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ум_ПакетыДанных.*
	|ИЗ
	|	РегистрСведений.ум_ПакетыДанных КАК ум_ПакетыДанных
	|ГДЕ
	|	ум_ПакетыДанных.ИдентификаторПакета В(&МассивИдентификаторов)";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("МассивИдентификаторов",  МассивИДПакетов);
	ТаблицаПакетов = Запрос.Выполнить().Выгрузить();
	
	НаборЗаписейПакетов = РегистрыСведений.ум_ПакетыДанных.СоздатьНаборЗаписей();
	НаборЗаписейПакетов.Загрузить(ТаблицаПакетов);
	
	Для каждого ЗаписьНабора из НаборЗаписейПакетов Цикл
		
		Если ОписаниеДействий.ИзменитьСпособОбработки или ОписаниеДействий.ИзменитьСостояние Тогда
			
			Если ОписаниеДействий.ИзменитьСпособОбработки тогда
				мСпособОбработки = ОписаниеДействий.СпособОбработки;
			Иначе
				мСпособОбработки = ЗаписьНабора.КлючАналитикиПакетаДанных.СпособОбработкиПакетов;
			КонецЕсли;
				
			Если ОписаниеДействий.ИзменитьСостояние тогда
				мСостояние = ОписаниеДействий.Состояние;
			Иначе
				мСостояние = ЗаписьНабора.КлючАналитикиПакетаДанных.СостояниеПакетаДанных;
			КонецЕсли;
			
			ЗаписьНабора.КлючАналитикиПакетаДанных = ум_ПакетыДанныхПовтИсп.ПолучитьКлючАналитикиПакетаДанных(мСпособОбработки, мСостояние);
			
		КонецЕсли;
		
		Если ОписаниеДействий.ИзменитьКоличествоПопытокОбработки Тогда
			ЗаписьНабора.КоличествоПопытокОбработки = ОписаниеДействий.КоличествоПопытокОбработки;
		КонецЕсли;
		
		Если ОписаниеДействий.ИзменитьПакетПрипаркован Тогда
			ЗаписьНабора.ПакетПрипаркован = ОписаниеДействий.ПакетПрипаркован;
		КонецЕсли;
		
		Если ОписаниеДействий.ИзменитьДатуСледующейобработки Тогда
			ЗаписьНабора.ДатаСледующейОбработкиПакета = ОписаниеДействий.ДатаСледующейобработки;
		КонецЕсли;
		
	КонецЦикла;
	
	Попытка
		НаборЗаписейПакетов.Записать(РежимЗамещения.Обновление);
	Исключение
		ОтменитьТранзакцию();
		Возврат Новый Структура("Ошибка, ОписаниеОшибки", Истина, ОписаниеОшибки()); 
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Новый Структура("Ошибка, ОписаниеОшибки", Ложь, );
	
КонецФункции

Функция ОбработчикПакетаДанных_ВыполнитьИзменениеПакетовДанных(Данные, ПараметрыПакетаДанных, ПараметрыСпособаОбработки) Экспорт
	Перем РезультатОбработки;
	////////////////////////////////////////////////////
	// КОД ОБРАБОТКИ ПАКЕТА
	// НАЧАЛО
	
	Результат = ИзмененитьПакетыДанных(Данные.ОписаниеДействий, Данные.МассивИДПакетов);
	Если Результат.Ошибка Тогда
		ВызватьИсключение Результат.ОписаниеОшибки;
	КонецЕсли;
	
	Сообщение = "Выполнено изменение " + Данные.МассивИДПакетов.Количество() + " пакетов.";
	
	// КОНЕЦ
	// КОД ОБРАБОТКИ ПАКЕТА
	////////////////////////////////////////////////////
	
	РезультатОбработкиПакета = Новый Структура;
	РезультатОбработкиПакета.Вставить("СостояниеПакетаДанных"	, Перечисления.ум_СостоянияПакетаДанных.Обработан);
	РезультатОбработкиПакета.Вставить("Сообщение"				, Сообщение);
	РезультатОбработкиПакета.Вставить("РезультатОбработки"		, РезультатОбработки);
	
	Возврат РезультатОбработкиПакета;
	
КонецФункции

Процедура СоздатьПакетыМногопоточноеИзменениеПакетовДанных(МассивИдентификаторов, ОписаниеДействий, ТекстОписания, РазмерПакета) Экспорт
	
	КоличествоВсего = МассивИдентификаторов.Количество();
	СпособОбработки = Справочники.ум_СпособыОбработкиПакетов.МногопоточноеИзменениеПакетовДанных;
	СформироватьСообщениеОСозданииПакетов(0, 0, КоличествоВсего, 0);
	
	МассивМассивовИдентификаторов = новый Массив;
	МассивИДПакетов = новый массив;
	Для Итер = 0 По КоличествоВсего - 1 Цикл
		Если Итер/РазмерПакета = Цел(Итер/РазмерПакета) Тогда
			Если МассивИДПакетов.Количество() Тогда
				МассивМассивовИдентификаторов.Добавить(МассивИДПакетов);
			КонецЕсли;
			МассивИДПакетов = новый массив;
		КонецЕсли;
		Если НЕ МассивИдентификаторов[Итер] = Неопределено Тогда
			МассивИДПакетов.Добавить(МассивИдентификаторов[Итер]);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивИДПакетов.Количество() Тогда
		МассивМассивовИдентификаторов.Добавить(МассивИДПакетов);
	КонецЕсли;
	
	КоличествоПакетов = 0;
	ПроцентВСообщении = 0;
	Количество = 0;
	Для каждого МассивИДПакетов из МассивМассивовИдентификаторов Цикл 
		
		Данные = новый Структура("МассивИДПакетов, ОписаниеДействий", МассивИДПакетов , ОписаниеДействий);
		Комментарий = "Изменение " + МассивИДПакетов.Количество() + " ид. " + ТекстОписания;
		Пакет = ум_ПакетыДанных.СоздатьПакетДанных(	Данные,
													СпособОбработки,
													,
													"ИзменениеПакетов",
													Комментарий
		);
		Если Пакет.Ошибка Тогда
			ВызватьИсключение Пакет.ОписаниеОшибки;
		КонецЕсли;
		
		КоличествоПакетов = КоличествоПакетов + 1;
		Количество = Количество + МассивИДПакетов.Количество();
		Процент = Окр(Количество / КоличествоВсего * 100);
		Если Не ПроцентВСообщении = Процент Тогда
			СформироватьСообщениеОСозданииПакетов(Процент, Количество, КоличествоВсего, КоличествоПакетов);
			ПроцентВСообщении = Процент;
		КонецЕсли;
		
	КонецЦикла;
	
	СформироватьСообщениеОСозданииПакетов(100, Количество, КоличествоВсего, КоличествоПакетов);
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьСообщениеОСозданииПакетов(Процент, Количество, КоличествоВсего, КоличествоПакетов)
	
	СтруктураСообщения = Новый Структура;
	СтруктураСообщения.Вставить("ТекстСообщения", "Выполняется создание пакетов данных." + Символы.ПС + "Пожалуйста, подождите...");
	СтруктураСообщения.Вставить("Прогресс", Процент);
	ТекстШаблона = "Обработано %1 из %2" + Символы.ПС +"Cоздано пакетов %3";
	ТекстОписания = СтрШаблон(ТекстШаблона, Количество, КоличествоВсего, КоличествоПакетов);
	СтруктураСообщения.Вставить("ТекстОписания", ТекстОписания);
	Результат = ЗначениеВСтрокуВнутр(СтруктураСообщения);
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Результат;
	Сообщение.Сообщить();
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
